app/controllers/api/reservations_controller.rb

INSERT INTO "reservations" ("doctor_id", "user_id", "date", "details", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["doctor_id", 1], ["user_id", 1], ["date", "2023-02-25"], ["details", "Some details"], ["created_at", "2023-02-24 15:55:27.524693"], ["updated_at", "2023-02-24 15:55:27.524693"]]
---
  def create
    @new_reservation = Reservation.new(reservation_params)

    if @new_reservation.save!