app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "salim"], ["created_at", "2023-02-27 10:44:56.215765"], ["updated_at", "2023-02-27 10:44:56.215765"]]

  def set_user
    @user = User.find_by(username: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "salim"], ["LIMIT", 1]]